RA4_DA3_25/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            symmetry;
    }
    right
    {
        type            fixedFluxPressure;
    }
    top
    {
        type            fixedFluxPressure;
    }
    bottom
    {
        type            fixedFluxPressure;
    }
 front
    {
     	type            symmetry;
    }
 back
    {
     	type            fixedFluxPressure;
    }
    
defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
