RA4_DA3_25/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0		0		0)		//0
(.5		0		0)		//1
(.5		1		0)		//2
(0      1		0)		//3

(0		0		.5)		//4
(.5		0		.5)		//5
(.5		1		.5)		//6
(0      1		.5)		//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 100 50) simpleGrading (1 1 1)
);

edges
(
);


boundary
(

left
{
type symmetry;
faces
(
(0 4 7 3)
);
}

right
{
type wall;
faces
(
(1 5 6 2)
);
}

top
{
type wall;
faces
(
(2 3 7 6)
);
}

bottom
{
type wall;
faces
(
(0 1 5 4)
);
}

front
{
type symmetry;
faces
(
(0 1 2 3)
);
}

back
{
type wall;
faces
(
(4 5 6 7)
);
}

);

mergePatchPairs
(
);

// ************************************************************************* //
