RA4_DA3_25/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default					steadyState;
}

gradSchemes
{
	default					Gauss linear;
}

divSchemes
{
	default					none;

	div(phi,U)				bounded Gauss upwind;
	div(phi,T)				bounded Gauss upwind;
}

laplacianSchemes
{
	default					Gauss linear corrected;
	laplacian((rho*(1|A(U))),p_rgh)		Gauss linear corrected;
	laplacian(T)				Gauss linear corrected;
}

interpolationSchemes
{
	default					linear;
}

snGradSchemes
{
	default					corrected;
}

fluxRequired
{
	default					no;
	p;
}

// ************************************************************************* //
