RA4_DA3_25/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(

    U
    {
        type    uniform;
        axis    z;
        start   (0 0.5 0);
        end     (0 0.5 0.5);
        nPoints 50;
    }

);


fields          (U T);

// ************************************************************************* //
